Dispatching.API/Templates/requestPayment.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sch="http://www.servicios.co/pagos/schemas">
  <soapenv:Header/>
  <soapenv:Body>
    <sch:PagoResource>
      <sch:referenciaFactura>
        <sch:referenciaFactura>{0}</sch:referenciaFactura>
      </sch:referenciaFactura>
      <sch:totalPagar>{1}</sch:totalPagar>
    </sch:PagoResource>
  </soapenv:Body>
</soapenv:Envelope>
