Infraestructura/databases/conveniosDB_configuracion.sql

INSERT INTO conveniosDB.configuracion (configuracion_id, partner_id, tipo_servicio, url, operacion, metodo, payload, reference_path, valor_path, mensaje_path) VALUES (1, 1, 'SOAP', 'http://3.92.245.156:8080/gas-service/PagosService', 'CONSULTAR', 'consultar', '<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sch="http://www.servicios.co/pagos/schemas"><soapenv:Header/><soapenv:Body><sch:ReferenciaFactura><sch:referenciaFactura>$1</sch:referenciaFactura></sch:ReferenciaFactura></soapenv:Body></soapenv:Envelope>', 'referenciaFactura.referenciaFactura', 'totalPagar', 'mensaje');
INSERT INTO conveniosDB.configuracion (configuracion_id, partner_id, tipo_servicio, url, operacion, metodo, payload, reference_path, valor_path, mensaje_path) VALUES (2, 1, 'SOAP', 'http://3.92.245.156:8080/gas-service/PagosService', 'PAGAR', 'pagar', '<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sch="http://www.servicios.co/pagos/schemas"><soapenv:Header/><soapenv:Body><sch:PagoResource><sch:referenciaFactura><sch:referenciaFactura>$1</sch:referenciaFactura></sch:referenciaFactura><sch:totalPagar>$2</sch:totalPagar></sch:PagoResource></soapenv:Body></soapenv:Envelope>', 'referenciaFactura.referenciaFactura', null, 'mensaje');
INSERT INTO conveniosDB.configuracion (configuracion_id, partner_id, tipo_servicio, url, operacion, metodo, payload, reference_path, valor_path, mensaje_path) VALUES (3, 1, 'SOAP', 'http://3.92.245.156:8080/gas-service/PagosService', 'COMPENSAR', 'compensar', '<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sch="http://www.servicios.co/pagos/schemas"><soapenv:Header/><soapenv:Body><sch:PagoResource><sch:referenciaFactura><sch:referenciaFactura>$1</sch:referenciaFactura></sch:referenciaFactura><sch:totalPagar>$2</sch:totalPagar></sch:PagoResource></soapenv:Body></soapenv:Envelope>', 'referenciaFactura.referenciaFactura', null, 'mensaje');
INSERT INTO conveniosDB.configuracion (configuracion_id, partner_id, tipo_servicio, url, operacion, metodo, payload, reference_path, valor_path, mensaje_path) VALUES (4, 2, 'REST', 'http://3.92.245.156:9090/servicios/pagos/v1/payments/$1', 'CONSULTAR', 'GET', null, 'idFactura', 'valorFactura', null);
INSERT INTO conveniosDB.configuracion (configuracion_id, partner_id, tipo_servicio, url, operacion, metodo, payload, reference_path, valor_path, mensaje_path) VALUES (5, 2, 'REST', 'http://3.92.245.156:9090/servicios/pagos/v1/payments/$1', 'PAGAR', 'POST', '{"valorFactura":$2}', 'idFactura', null, 'mensaje');
INSERT INTO conveniosDB.configuracion (configuracion_id, partner_id, tipo_servicio, url, operacion, metodo, payload, reference_path, valor_path, mensaje_path) VALUES (6, 2, 'REST', 'http://3.92.245.156:9090/servicios/pagos/v1/payments/$1', 'COMPENSAR', 'DELETE', '{"valorFactura":$2}', 'idFactura', null, 'mensaje');